cfg/DataProcessors/ПолучениеФайловИзИнтернета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПолучениеФайловИзИнтернета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапомнитьИмяИПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверИсточник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПараметраПолучения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВходящегоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfg/DataProcessors/ПолучениеФайловИзИнтернета/Forms/ФормаПараметрыПрокси/Ext/Form/Module.bsl
#Если Клиент Тогда

// Обработчик события формы "ПередОткрытием".
// 
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПризнакОткрытияФормыИзЯзыка Тогда
		Предупреждение(НСтр("ru='Данная обработка используется в служебных целях, открытие формы запрещено.';uk='Дана обробка використовується в службових цілях, відкриття форми заборонене.'"));
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события "Нажатие" кнопки "ОК" командной панели формы "ОсновныеДействияФормы"
// 
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Перем HTTP;
	
	Если ЗапомнитьИмяИПароль Тогда
		СохранитьЗначение("ЗапомнитьИмяИПарольПрокси", Истина);
		СохранитьЗначение("ИмяПользователяПрокси"    , ИмяПользователя);
		СохранитьЗначение("ПарольПользователяПрокси" , ПарольПользователя);
	Иначе
		СохранитьЗначение("ЗапомнитьИмяИПарольПрокси", Ложь);
		СохранитьЗначение("ИмяПользователяПрокси"    , "");
		СохранитьЗначение("ПарольПользователяПрокси" , "");
	КонецЕсли; 
	
	Попытка
		ПроксиСервер = Новый ИнтернетПрокси();
		ПроксиСервер.Пользователь = ИмяПользователя;
		ПроксиСервер.Пароль       = ПарольПользователя;
		HTTP = Новый HTTPСоединение(СерверИсточник,,,, ПроксиСервер);
		HTTP.Получить(СтрокаПараметраПолучения, ИмяВходящегоФайла);
	Исключение
		Если ПустаяСтрока(ОписаниеОшибки()) Тогда
			Сообщить(НСтр("ru='Не удалось установить соединение с сервером!';uk=""Не вдалося встановити з'єднання із сервером!"""));
		ИначеЕсли Найти(ОписаниеОшибки(), "407") <> 0 И Найти(НРег(ОписаниеОшибки()), "auth") <> 0 Тогда
			Предупреждение(НСтр("ru='Не правильные имя или пароль доступа!';uk=""Не правильні ім'я або пароль доступу!"""));
		Иначе
			Сообщить("" + ОписаниеОшибки());
		КонецЕсли; 
		Возврат;
	КонецПопытки;
	
	ЭтаФорма.Закрыть(HTTP);
	
КонецПроцедуры

#КонецЕсли
